cf/InformationRegisters/обм_ЛогЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>обм_ЛогЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокрТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИДзапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/обм_НаборыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>обм_НаборыДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ОбменДанными</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмОтправленияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмОтправленияДанныхСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияДанныхСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЗначенияСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияКлюча</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияКлючаСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПреобразованияJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПреобразованияJSONСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриемаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриемаДанныхСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Comment>Будефт фиксировать объект для выгрузки если изменился</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаДляТеста</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрТипы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляДат</Name>
					<Comment>Поля набора через запитую с типом дата</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбрабатываемыеТипы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПустаяСсылка</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоОсновной</Name>
							<Comment>Значит при получении объекта по типу из ключа будет работать этот набор</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/обм_ОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>обм_ОбменДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумОбъектовВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьВБуфере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствияПутей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьТут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьТам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/HTTPServices/обм_Обмен/Ext/Module.bsl
Процедура ЛогЗапроса(Запрос, ТелоЭтоФайл = Ложь)
	
	Если Константы.обм_ВестиЛогЗапросов.Получить() Тогда
	
		Результат = ">> " + Запрос.HTTPМетод + " -> " + Запрос.ОтносительныйURL + Символы.ПС;
		Результат = Результат + Запрос.БазовыйURL + Символы.ПС;
		Результат = Результат + "Заголовки:" + Символы.ПС;
			
		Для каждого Параметр Из Запрос.Заголовки Цикл Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС; КонецЦикла;
		Результат = Результат + "Параметры URL:" + Символы.ПС;
		Для каждого Параметр Из Запрос.ПараметрыURL Цикл Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС; КонецЦикла;
		Результат = Результат + "Параметры запроса:" + Символы.ПС;
		Для каждого Параметр Из Запрос.ПараметрыЗапроса Цикл Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС; КонецЦикла;
			
		Результат = Результат + "Тело запроса:" + Символы.ПС + ?(ТелоЭтоФайл, " тело это файл не логируется ", Запрос.ПолучитьТелоКакСтроку());
			
		Запись = РегистрыСведений.обм_ЛогЗапросов.СоздатьМенеджерЗаписи();
		Запись.ИДзапроса = Новый УникальныйИдентификатор;
		Запись.Дата 		= ТекущаяДата(); 
		Запись.СокрТекст 	= Результат;
		Запись.Текст 		= Результат;
		Запись.Записать(); КонецЕсли;
	
КонецПроцедуры
Процедура ЛогОтвета(Ответ, ТелоЭтоФайл = Ложь)
	
	Если Константы.обм_ВестиЛогЗапросов.Получить() Тогда
	
		Результат = "<< " + Ответ.КодСостояния + " " + Ответ.Причина + Символы.ПС;
		Результат = Результат + "Заголовки:" + Символы.ПС;
		Для каждого Параметр Из Ответ.Заголовки Цикл Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС; КонецЦикла;
		
		Результат = Результат + "Тело ответа:" + Символы.ПС + ?(ТелоЭтоФайл, " тело это файл не логируется ", Ответ.ПолучитьТелоКакСтроку());
		
		Запись = РегистрыСведений.обм_ЛогЗапросов.СоздатьМенеджерЗаписи();
		Запись.ИДзапроса = Новый УникальныйИдентификатор;
		Запись.Дата 		= ТекущаяДата(); 
		Запись.СокрТекст 	= Результат;
		Запись.Текст 		= Результат;
		Запись.Записать(); КонецЕсли;
	
КонецПроцедуры

Функция ЗаголовкиЗаполнены(Запрос, кодОшибки, стрОшибки, З1 = Ложь, З2 = Ложь, З3 = Ложь)
	
	Структура = Новый Структура("ИдОбмена, ИдНабора, КлючОбъекта");
	
	Если З1 Тогда
		Структура.ИдОбмена = Запрос.Заголовки["exh1-txt"];
		Если Структура.ИдОбмена = Неопределено Тогда
			кодОшибки = 500;
			стрОшибки = "В заголовке ну установлен идентификатор обмена (exh1-txt)";
			Возврат Неопределено; КонецЕсли; КонецЕсли;
	
	Если З2 Тогда
		Структура.ИдНабора = Запрос.Заголовки["exh2-txt"];
		Если Структура.ИдНабора = Неопределено Тогда 
			кодОшибки = 500;
			стрОшибки = "В заголовке ну установлен идентификатор набора (exh2-txt)";
			Возврат Неопределено; КонецЕсли; КонецЕсли;

	Если З3 Тогда
		Структура.КлючОбъекта = Запрос.Заголовки["exh3-txt"];
		Если Структура.ИдНабора = Неопределено Тогда 
			кодОшибки = 500;
			стрОшибки = "В заголовке ну установлен идентификатор объекта (exh3-txt)";
			Возврат Неопределено; КонецЕсли; КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьНаборИзЗапроса(Запрос, кодОшибки, стрОшибки)
	
	Заголовки = ЗаголовкиЗаполнены(Запрос, кодОшибки, стрОшибки, Истина, Истина);
	Если Заголовки = Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	// Определим каким правилом обрабатывать запрос вытащив их из заголовка
	
	ЗапросПоиска = Новый Запрос("
	|ВЫБРАТЬ Ссылка ИЗ Справочник.обм_НаборыДанных 
	|ГДЕ 	НЕ ПометкаУдаления И 
	|		Активно И
	|		Наименование 			= """ + Заголовки.ИдНабора + """ И
	|		Владелец.Наименование 	= """ + Заголовки.ИдОбмена + """ И
	|		НЕ Владелец.ПометкаУдаления");
	Выборка = ЗапросПоиска.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		
		кодОшибки = 500;
		стрОшибки = "Обмен (" + Заголовки.ИдОбмена + "); Набор (" + Заголовки.ИдНабора + ") найдено больше 1";
		Возврат Неопределено;
		
	ИначеЕсли Не Выборка.Количество() Тогда	
		
		кодОшибки = 500;
		стрОшибки = "Обмен (" + Заголовки.ИдОбмена + "); Набор (" + Заголовки.ИдНабора + ") не найдено";
		Возврат Неопределено; КонецЕсли;
		
		
	Выборка.Следующий(); 
	Возврат Выборка.Ссылка;
	
КонецФункции
Функция ПолучитьОбменИзЗапроса(Запрос, КодОшибки, стрОшибки)
	
	ИдОбмена = Запрос.Заголовки["exh1-txt"];
	Если ИдОбмена = Неопределено Тогда
		кодОшибки = 500;
		стрОшибки = "В заголовке ну установлен идентификатор обмена (exh1-txt)";
		Возврат Неопределено; КонецЕсли;
	
	// Определим каким правилом обрабатывать запрос вытащив их из заголовка
	
	ЗапросПоиска = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.обм_ОбменДанными ГДЕ НЕ ПометкаУдаления И Наименование = """ + ИдОбмена + """");
	Выборка = ЗапросПоиска.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		
		кодОшибки = 500;
		стрОшибки = "Обмен (" + ИдОбмена + "); найдено больше 1";
		Возврат Неопределено;
		
	ИначеЕсли Не Выборка.Количество() Тогда	
		
		кодОшибки = 500;
		стрОшибки = "Обмен (" + ИдОбмена + "); не найдено";
		Возврат Неопределено; КонецЕсли;
		
	Выборка.Следующий(); 
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ВернутьОшибку(КодСостояния, ТекстОшибки)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния, ТекстОшибки);
	Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	
	ЛогОтвета(Ответ);
	
	Возврат Ответ;
	
КонецФункции
Функция ДанныеОтправить(Запрос)
	
	Перем стрОшибки, кодОшибки;
	
	// Получает данные из другой базы обмена и записывает данные в текущей базе
	
	ЛогЗапроса(Запрос);
	
	// Проверим чтобы в заголовках содержалась необходимая информация
	
	Набор = ПолучитьНаборИзЗапроса(Запрос, кодОшибки, стрОшибки);
	Если Набор = Неопределено Тогда Возврат ВернутьОшибку(кодОшибки, стрОшибки); КонецЕсли;

	// Прочитаем JSON
	
	стрОшибки = "";
	Данные = обм_Обмен.ПреобразоватьИзJSON(Запрос.ПолучитьТелоКакСтроку(), стрОшибки,, Набор.ПоляДат);
	Если Данные = Неопределено Тогда Возврат ВернутьОшибку(418, стрОшибки); КонецЕсли;
	
	// Отправим на прием
	
	Результат = обм_Обмен.ПринятьНаборДанных(Набор, Данные, Новый Соответствие, стрОшибки);
	Если Не Результат Тогда Возврат ВернутьОшибку(418, стрОшибки); КонецЕсли;
	
	// Вернем результат
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЛогОтвета(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция МетаданныеПолучить(Запрос)
	
	Перем стрОшибки, кодОшибки;
	
	// Получает данные из другой базы обмена и записывает данные в текущей базе
	
	ЛогЗапроса(Запрос);
	
	// Проверим чтобы в заголовках содержалась необходимая информация
	
	Обмен = ПолучитьОбменИзЗапроса(Запрос, КодОшибки, стрОшибки);
	Если Обмен = Неопределено Тогда ВернутьОшибку(кодОшибки, стрОшибки); КонецЕсли;
	
	стрОтвет = обм_Обмен.ПреобразоватьВJSON(,обм_Обмен.ПолучитьСтруктуруКонфигурации(Обмен), Новый Соответствие);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(стрОтвет);
	
	ЛогОтвета(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция ДанныеПолучить(Запрос)
	ЛогЗапроса(Запрос);
	Ответ = Новый HTTPСервисОтвет(200);
	ЛогОтвета(Ответ);
	Возврат Ответ;
КонецФункции

Функция ОбъектПолучить(Запрос)
	
	Перем стрОшибки, кодОшибки;
	
	КэшДанные = Новый Соответствие;
	
	// Получает данные из другой базы обмена и записывает данные в текущей базе
	
	ЛогЗапроса(Запрос);
	
	// Получим набор
	
	Набор = ПолучитьНаборИзЗапроса(Запрос, кодОшибки, стрОшибки);
	Если Набор = Неопределено Тогда Возврат ВернутьОшибку(кодОшибки, стрОшибки); КонецЕсли;
	
	// Получим ключ
	
	стрКлюч = Запрос.ПолучитьТелоКакСтроку();
	Ключ 	= обм_Обмен.ПреобразоватьИзJSON(стрКлюч, стрОшибки);
	Если Ключ = Неопределено Тогда
		Возврат ВернутьОшибку(500, "Ошибка получения ключа из JSON " + Набор + " " + стрКлюч + " " + стрОшибки) КонецЕсли;
	
	// Получим объект по ключу
	
	Ссылка = обм_Среда.ПолучитьСсылкуПоКлючу(Ключ, Набор, КэшДанные);
	Если Ссылка = Неопределено Тогда
		Возврат ВернутьОшибку(500, "не нашлась ссылка по ключу " + Набор + " " + ЗначениеВСтрокуВнутр(Ключ)) КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Ссылка);
	Данные = обм_Обмен.ВычислитьСтруктуруПоНаборуДанных(Набор, Массив, КэшДанные);
	Если ТипЗнч(Данные) <> Тип("Массив") Или Не Данные.Количество() Тогда
		Возврат ВернутьОшибку(500, "нет данных для объекта " + Набор + " " + ЗначениеВСтрокуВнутр(Ключ)) КонецЕсли;
	
	// Упакуем
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(обм_Обмен.ПреобразоватьВJSON(Набор, Данные[0], КэшДанные));
	
	// Вернем
	
	ЛогОтвета(Ответ);
	Возврат Ответ;
	
КонецФункции

Функция НаборСоздать(Запрос)
	
	Перем стрОшибки, кодОшибки;
	
	// Получим обмен
	
	Обмен = ПолучитьОбменИзЗапроса(Запрос, КодОшибки, стрОшибки);
	Если Обмен = Неопределено Тогда ВернутьОшибку(кодОшибки, стрОшибки); КонецЕсли;
	
	// Получим набор
	
	ИдНабора = Запрос.Заголовки["exh2-txt"];
	Если ИдНабора = Неопределено Тогда 
		Возврат ВернутьОшибку(500, "В заголовке ну установлен идентификатор набора (exh2-txt)"); КонецЕсли;

	// Прочитаем JSON
	
	стрОшибки = "";
	Данные = обм_Обмен.ПреобразоватьИзJSON(Запрос.ПолучитьТелоКакСтроку(), стрОшибки);
	Если Данные = Неопределено Тогда Возврат ВернутьОшибку(418, стрОшибки); КонецЕсли;

	// Создадим и обновим набор новыми данными
	
	Набор = Справочники.обм_НаборыДанных.СоздатьЭлемент();
	Набор.Владелец 		= Обмен;
	Набор.Наименование 	= ИдНабора;
	
	Если Не обм_Обмен.ИзменитьНаборПоJSONНабору(Набор, Данные, стрОшибки) Тогда
		Возврат ВернутьОшибку(500, стрОшибки); КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
Функция НаборИзменить(Запрос)
	
	Перем стрОшибки, кодОшибки;
	
	ЛогЗапроса(Запрос);
	
	// Получим набор
	
	Набор = ПолучитьНаборИзЗапроса(Запрос, кодОшибки, стрОшибки);
	Если Набор = Неопределено Тогда ВернутьОшибку(кодОшибки, стрОшибки); КонецЕсли;
	
	// Прочитаем JSON
	
	стрОшибки = "";
	Данные = обм_Обмен.ПреобразоватьИзJSON(Запрос.ПолучитьТелоКакСтроку(), стрОшибки);
	Если Данные = Неопределено Тогда Возврат ВернутьОшибку(418, стрОшибки); КонецЕсли;

	// Обновим набор новыми данными
	
	Если обм_Обмен.ИзменитьНаборПоJSONНабору(Набор.ПолучитьОбъект(), Данные, стрОшибки) Тогда
		ВернутьОшибку(500, стрОшибки); КонецЕсли;
	
	// Вернем ок
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
Функция НаборПолучть(Запрос)
	
	Перем стрОшибки, кодОшибки;
	
	ЛогЗапроса(Запрос);
	
	// Получим набор
	
	Набор = ПолучитьНаборИзЗапроса(Запрос, кодОшибки, стрОшибки);
	Если Набор = Неопределено Тогда ВернутьОшибку(кодОшибки, стрОшибки); КонецЕсли;
	
	// Вернем набор
	
	стрОтвет = обм_Обмен.ПреобразоватьВJSON(,обм_Обмен.ПолучитьСтруктуруКонфигурации(Набор.Владелец, "Наборы", Набор), Новый Соответствие);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(стрОтвет);
	
	Возврат Ответ;
	
КонецФункции
